app/Http/Controllers/Blog/PostController.php

    public function index()
    {
        $items = BlogPost::all();
---
select * from `blog_posts`